#!/bin/bash
#Что проверять:
#Результат (unit_test)
#v1. результат Равносторонний
#v2. результат Равнобедренный
#v3. результат обычный
#Стороны (unit_test/проверка)
#v4. a+b > c
#v5. a+c > b
#v6. b+c > a
#v7.a > 0
#v8.b > 0
#v9 c > 0
#v10.a != текст
#v11.b != текст
#v12.с != текст
#v13.a != не пустое
#v14.b != не пустое
#v15.c != не пустое

#ВЫЗОВ БЕЗ КЛЮЧА:	Вызываю функцию param, в ней вложена функция main 
#ВЫЗОВ С КЛЮЧОМ -t: Обращаюсь на прямую в функцию main

#Функция тестирования
function test() {
	local a=$1 b=$2 c=$3
	cheks $a $b $c
	main $a $b $c
}	
#функция передачи/получения параметров для функции
function param() {
	local a b c
	a=$1 b=$2 c=$3
	echo "$a $b $c"
	echo -n "Введите 3 стороны треугольника: "
	read -n 3 a b c
	cheks $a $b $c
	main $a $b $c
}

#Функция с проверками
function cheks() {
#	set -x -e
	local a=$1 b=$2 c=$3
#Проверка на пустое значение
	if [ -z $a ] || [ -z $b ] || [ -z $c ]; then
		echo "Не переданы параметры в переменную"
		exit 2
	fi
#Проверка на текст
	re='[^0-9]+$'
    if  [[ $a =~ $re ]]; then
		echo "Ошибка ввода: неожидаемый строковый параметр"
		exit 1
    fi
    if  [[ $b =~ $re ]]; then
		echo "Ошибка ввода: неожидаемый строковый параметр"

		exit 1
    fi
    if  [[ $c =~ $re ]]; then
		echo "Ошибка ввода: неожидаемый строковый параметр"
		exit 1
    fi
#Проверка на отрицательные значения в параметрах
	if [ "$a" -le 0 -o "$b" -le 0 -o "$c" -le 0 ]; then
        echo "Error, one of the parameters a, b or c for the function main() is less than or equal to 0"
        exit 5
    fi 
#Проверка на возможность построения треугольника
    if ! (( "$a + $b" >= "$c" && "$a + $c" >= "$b" && "$b" + "$c" >= "$a")); then
		echo "Error! Треугольник не существует" 
		exit 1
	fi
}
#Основная функция/блок программы
function main() {
#код программы
	local a=$1 b=$2 c=$3
	#d="Треугольник равносторонний"
	#e="Треугольник равнобедренный"
	#f="Обчычный треугольник"
	if [ "$a" -eq "$b" -a "$a" -eq "$c" ]; then
        echo "Треугольник равносторонний"
	elif [ "$a" -eq "$b" -o "$a" -eq "$c" -o "$c" -eq "$b" ]; then
        echo "Треугольник равнобедренный"
	else echo "Обчычный треугольник" 
fi
}
#Тесты
function run_test() {
	set -x -e
#Треугольник равносторонний
	for (( s1=100; s1 < 103; s1++ ))
{
	[ "$(test $s1 $s1 $s1)" = "Треугольник равносторонний" ]
}
#Треугольник равнобедренный
for (( s1=100, s2=101; s1 < 103; s1++,s2++ ))
{
	[ "$(test $s1 $s1 $s2)" = "Треугольник равнобедренный" ]
	[ "$(test $s1 $s2 $s2)" = "Треугольник равнобедренный" ]
	[ "$(test $s1 $s2 $s1)" = "Треугольник равнобедренный" ]
	[ "$(test $s2 $s1 $s1)" = "Треугольник равнобедренный" ]
	[ "$(test $s2 $s1 $s2)" = "Треугольник равнобедренный" ]
	[ "$(test $s2 $s2 $s1)" = "Треугольник равнобедренный" ]
}
for (( s1=100; s1 < 103; s1++ ))
{
	for (( s2=100; s2 < 103; s2++ ))
	{
		for (( s3=100; s3 < 103; s3++ ))
		{
			echo "$s1 $s2 $s3"
			if ! [ "$s1" -eq "$s2" -a "$s1" -eq "$s3" ]; then
				echo "$s1 $s2 $s3"
				[ "$(test 1 2 3)" = "Обчычный треугольник" ]
			fi
		}
	}
}
#	[ "$(test 2 1 2)" = "" ] # echo -e "\e[1;32m[ OK ]\e[0m" || echo -e "\e[1;31mFAIL\e[0m"
	[ "$(test 1 2 3)" = "Обчычный треугольник" ] # echo -e "\e[1;32m[ OK ]\e[0m" || echo -e "\e[1;31mFAIL\e[0m "
#	[ "$(test 1 2 3)" = "" ]
#	[ "$(test 1 2 3)" = "" ]
#	[ "$(test 1 2 3)" = "" ]
	[ "$(test  2 3)" = "Не переданы параметры в переменную" ]
	[ "$(test 1  3)" = "Не переданы параметры в переменную" ]
	[ "$(test 1 2 )" = "Не переданы параметры в переменную" ]
	[ "$(test 1 )" = "Не переданы параметры в переменную" ]
	[ "$(test )" = "Не переданы параметры в переменную" ]
	[ "$(test m 2 3)" = "Ошибка ввода: неожидаемый строковый параметр" ]
	[ "$(test 1 0 3)" = "Error, one of the parameters a, b or c for the function main() is less than or equal to 0" ]
	[ "$(test 1 2 3)" = "Error! Треугольник не существует" ]
}
if [ "$1" = "-t" ]; then
	run_test
else
	param
#	param $1 $2 $3
fi
echo "$a $b $c"
